other-codes/openfoam-toolchain-with-gmsh-main/Templates/solver/simpleFoam/Template_Szenario_Demo/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication $application

#------------------------------------------------------------------------------
