other-codes/openfoam-toolchain-with-gmsh-main/Templates/solver/simpleFoam/Template_Szenario_Demo/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     _VARapplication_;

startFrom       startTime;

startTime       _VARstartTime_;

stopAt          endTime;

endTime         _VARendTime_;

deltaT          _VARdeltaT_;

writeControl    _VARwriteControl_;

writeInterval   _VARwriteIntervall_;

purgeWrite      _VARpurgeWrite_;

writeFormat     ascii;

writePrecision  _VARwritePrecision_;

writeCompression _VARwriteCompression_;

timeFormat      _VARtimeFormat_;

timePrecision   _VARtimePrecision_;

runTimeModifiable _VARrunTimeModifiable_;


// ************************************************************************* //
